---
type: RectangleLightShape
namespace: Autodesk.Revit.DB.Lighting
version: 2024
members: 4
tags: [revit-api, class]
---

# RectangleLightShape

`Autodesk.Revit.DB.Lighting.RectangleLightShape` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RectangleLightShape | — | `` |
| Constructor | RectangleLightShape | 2013 | `public RectangleLightShape ()` |
| Property | EmitLength | 2013 | `public double EmitLength { get ; set ; }` |
| Property | EmitWidth | 2013 | `public double EmitWidth { get ; set ; }` |